//整型数据的运算与分析
//鸡兔同笼问题
#include <stdio.h>
//解决思路，设鸡的数量为x，兔的数量为y，总头数为h，总脚数为f
//x+y=h
//2x+4y=f
//例2.1，总头数为16，总脚数为40
int main()
{
	int x, y, h, f;
	h = 16;
	f = 40;
	y = (f-2*h)/2;	//经过数学变换，将y的函数转换为h和f的算式
	x = h - y;	//经过数学变换，将x的函数转换为h和f的算式
	printf("鸡的数量为：%d\n兔子的数量为：%d\n", x, y);

}


//【拓展】输入计算鸡兔同笼
/*
int main()
{
	int x, y, h, f;
	printf("请输入总头的数量：\n");
	scanf_s("%d", &h, 1);
	printf("请输入总脚数：\n");
	scanf_s("%d", &f, 1);
	y = (f - 2 * h) / 2;	//经过数学变换，将y的函数转换为h和f的算式
	x = h - y;	//经过数学变换，将x的函数转换为h和f的算式
	printf("鸡的数量为：%d\n兔子的数量为：%d\n", x, y);
}
//TODO
*/